app/Controllers/Board.php

    public function save()
    {
        // $db = db_connect();
        // $subject = $this->request->getVar('subject');
        // $content = $this->request->getVar('content');
        // $myTime = new Time('now', 'Asia/Seoul');
        // $myTime ->modify('+9 hours');
        // $formattedTime = $myTime -> toDateTimeString();

        // $sql = "INSERT INTO board (userid, subject, content, regdate) VALUES('test', ?,?,?)";
        // $result = $db -> query($sql,[$subject, $content, $formattedTime]);
        $boardModel = new BoardModel();

        $myTime = new Time('now', 'Asia/Seoul');
        $myTime ->modify('+9 hours');

        $data = [
            'userid' => 'test',
            'subject' => $this->request->getVar('subject'),
            'content' => $this->request->getVar('content'),
            'regdate' => $myTime -> toDateTimeString()
        ];
        $boardModel ->insert($data);
---
INSERT INTO `board` (`userid`, `subject`, `content`, `regdate`) VALUES ('test', '입력 테스트5', '내용 테스트5', '2023-09-11 11:53:30')