app/Controllers/Board.php

    public function list(): string
    {
        // return view('board_list');
        // $db = db_connect();
        // $sql = "SELECT * from board order by bid desc";
        // $result = $db -> query($sql);
        // $data['list'] = $result->getResult(); //fetch_object 글 결과 배열에 담기
        $boardModel = new BoardModel();
        $data['list'] = $boardModel -> orderBy('bid', 'desc')->findAll();
---
SELECT *
FROM `board`
WHERE 1 = 1
ORDER BY `bid` DESC
 LIMIT 10, 10

    public function view($bid = null)
    {
        // $db = db_connect();
        // $sql = "SELECT * from board where bid={$bid}";
        // $result = $db -> query($sql);
        // $data['view'] = $result->getRow();
        $boardModel = new BoardModel();
        $data['view'] = $boardModel -> where('bid', $bid)->first();
---
SELECT *
FROM `board`
WHERE `bid` = '15'
 LIMIT 1

            return $this->response ->redirect(site_url('/boardview/'.$bid)); //쿼리성공후 board 페이지로 이동
        }else{ //신규 글 등록
            $boardModel ->insert($data);
            $insertid= $db->insertID();//board테이블에 글등록후 생기는 고유id를 생성
---
INSERT INTO `board` (`userid`, `subject`, `content`, `regdate`) VALUES ('test', '테스트 13', '테스트 13', '2023-09-13 11:10:32')

    public function modify($bid = null)
    {
        /*
        $db = db_connect();
        $sql = "SELECT * FROM board WHERE bid={$bid}";
        $result = $db->query($sql);
        if($_SESSION['userid'] == $result ->getRow()->userid){
            $data['view']= $result ->getRow();
            return render('board_write',$data);
        } else {
            echo "<script>
                alert('본인글만 수정할 수 있습니다.');
                location.href='/board';
            </script>";
        }*/
        $boardModel = new BoardModel();
        $board = $boardModel->find($bid);
---
SELECT *
FROM `board`
WHERE `board`.`bid` = '14'