app/Controllers/Board.php

    public function list(): string
    {
        $boardModel = new BoardModel();
        $page = $this->request->getVar('page') ?? 1;
        $perPage = 10;
        $startLimit = ($page-1)*$perPage;

        $list = $boardModel -> select('*') -> where('1=1') -> orderBy('bid', 'desc')->limit($perPage, $startLimit)->findAll($perPage, $startLimit);
---
SELECT COUNT(*) AS `numrows`
FROM `board`

        }

        if($bid){ //수정
            $boardModel ->update($bid,$data);
---
UPDATE `board` SET `userid` = 'test', `subject` = '테스트 13 - 수정', `content` = '테스트 13 - 수정', `regdate` = '2023-09-13 11:11:10'
WHERE `board`.`bid` IN ('13')